** ruby 

#+BEGIN_SRC ruby :sesseion ruby :results output
# coding: utf-8

require 'rubygems'
require 'sqlite3'

db = SQLite3::Database.new("database.db")

sql = <<EOT
create table Person (
 name varchar(10),
 age integer,
 post varchar(200)
);
EOT

db.execute(sql)
puts "New file is created."

db.transaction do
  sql = "insert into Person values (?, ?, ?)"
  db.execute(sql, 'hoge', 26, 'hage')
  db.execute(sql, 'hage', 62, 'hoge')
end

db.execute('select * from Person') do |row|
  puts row.join("\t")
end
db.close

'end'

#+END_SRC

#+RESULTS:
: New file is created.
: hoge	26	hage
: hage	62	hoge


** firefox sqlite database handling

   [[https://support.mozilla.org/ja/kb/profiles-where-firefox-stores-user-data#w_cucgciaaacceaeakiuaiauadaeaoceag][プロファイル | Firefox ヘルプ]] 

firefox が使っている sqlite データベースをコピーして，
テーブルのレコードを出力する。

#+BEGIN_SRC sh :results output scalar
ls ~/.mozilla/firefox
cp -p ~/.mozilla/firefox/5rot7npz.default/content-prefs.sqlite .
#+END_SRC

#+RESULTS:
: 5rot7npz.default
: Crash Reports
: console.log
: profiles.ini

#+BEGIN_SRC ruby :session ruby :results output
# coding: utf-8

require 'rubygems'
require 'sqlite3'
require 'pp'

file = "content-prefs.sqlite"

db = SQLite3::Database.open(file)

tables = db.execute("select tbl_name FROM sqlite_master WHERE type == 'table'")

tables.flatten.each do |tbl|
  puts "== ",  tbl
  db.results_as_hash = true
  db.execute("select * from #{tbl}") do |row|
    # puts row.join("\t")
    pp row
  end
end

p tables

db.close

'end'
#+END_SRC

#+RESULTS:
#+begin_example

irb(main):135:0* => false
=> false
=> false
irb(main):139:0* => "content-prefs.sqlite"
irb(main):141:0* => #<SQLite3::Database:0x007f54f97c0d30 @tracefunc=nil, @authorizer=nil, @encoding=nil, @busy_handler=nil, @collations={}, @functions={}, @results_as_hash=nil, @type_translation=nil, @readonly=false>
irb(main):143:0* => [["groups"], ["settings"], ["prefs"]]
irb(main):145:0* irb(main):146:1* irb(main):147:1> irb(main):148:1> irb(main):149:2* irb(main):150:2* irb(main):151:2> irb(main):152:1> == 
groups
{"id"=>1, "name"=>"wiki.cis.iwate-u.ac.jp", 0=>1, 1=>"wiki.cis.iwate-u.ac.jp"}
{"id"=>2, "name"=>"about:startpage", 0=>2, 1=>"about:startpage"}
{"id"=>3, "name"=>"www.google.com", 0=>3, 1=>"www.google.com"}
{"id"=>4, "name"=>"qiita.com", 0=>4, 1=>"qiita.com"}
{"id"=>5, "name"=>"subversion.apache.org", 0=>5, 1=>"subversion.apache.org"}
{"id"=>6, "name"=>"stackoverflow.com", 0=>6, 1=>"stackoverflow.com"}
{"id"=>7, "name"=>"www.google.co.jp", 0=>7, 1=>"www.google.co.jp"}
{"id"=>8, "name"=>"www.amazon.co.jp", 0=>8, 1=>"www.amazon.co.jp"}
{"id"=>9, "name"=>"orgmode.org", 0=>9, 1=>"orgmode.org"}
{"id"=>10, "name"=>"about:newtab", 0=>10, 1=>"about:newtab"}
{"id"=>11, "name"=>"ja.wikipedia.org", 0=>11, 1=>"ja.wikipedia.org"}
{"id"=>12,
 "name"=>"spws01.cis.iwate-u.ac.jp",
 0=>12,
 1=>"spws01.cis.iwate-u.ac.jp"}
{"id"=>13, "name"=>"www.ietf.org", 0=>13, 1=>"www.ietf.org"}
{"id"=>14, "name"=>"www.ipa.go.jp", 0=>14, 1=>"www.ipa.go.jp"}
{"id"=>15, "name"=>"svn.cis.iwate-u.ac.jp", 0=>15, 1=>"svn.cis.iwate-u.ac.jp"}
{"id"=>16, "name"=>"www.geocities.jp", 0=>16, 1=>"www.geocities.jp"}
{"id"=>17, "name"=>"www6.airnet.ne.jp", 0=>17, 1=>"www6.airnet.ne.jp"}
{"id"=>18, "name"=>"en.wikipedia.org", 0=>18, 1=>"en.wikipedia.org"}
{"id"=>19, "name"=>"dictionary.goo.ne.jp", 0=>19, 1=>"dictionary.goo.ne.jp"}
{"id"=>20,
 "name"=>"wiki.eecs.iwate-u.ac.jp",
 0=>20,
 1=>"wiki.eecs.iwate-u.ac.jp"}
{"id"=>21,
 "name"=>
  "file:///home/staff/suzuki/COMM/Lects/prog/site/org-docs/cutter/cutter-doc.html",
 0=>21,
 1=>
  "file:///home/staff/suzuki/COMM/Lects/prog/site/org-docs/cutter/cutter-doc.html"}
{"id"=>22,
 "name"=>"cutter.sourceforge.net",
 0=>22,
 1=>"cutter.sourceforge.net"}
{"id"=>23, "name"=>"www.gnu.org", 0=>23, 1=>"www.gnu.org"}
{"id"=>24,
 "name"=>"file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/ruby_begin.html",
 0=>24,
 1=>"file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/ruby_begin.html"}
{"id"=>25, "name"=>"magazine.rubyist.net", 0=>25, 1=>"magazine.rubyist.net"}
{"id"=>26, "name"=>"loveruby.net", 0=>26, 1=>"loveruby.net"}
{"id"=>27,
 "name"=>
  "file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/docs/meta-ruby/index.html",
 0=>27,
 1=>
  "file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/docs/meta-ruby/index.html"}
{"id"=>28, "name"=>"ops.tokyo", 0=>28, 1=>"ops.tokyo"}
{"id"=>29,
 "name"=>
  "file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/lects/01/01-GTD.html",
 0=>29,
 1=>"file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/lects/01/01-GTD.html"}
{"id"=>30, "name"=>"www.bookshelf.jp", 0=>30, 1=>"www.bookshelf.jp"}
{"id"=>31, "name"=>"www.ogis-ri.co.jp", 0=>31, 1=>"www.ogis-ri.co.jp"}
{"id"=>32, "name"=>"mitpress.mit.edu", 0=>32, 1=>"mitpress.mit.edu"}
{"id"=>33,
 "name"=>
  "file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/org-docs/index.html",
 0=>33,
 1=>"file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/org-docs/index.html"}
{"id"=>34, "name"=>"libro.tuyano.com", 0=>34, 1=>"libro.tuyano.com"}
{"id"=>35, "name"=>"docs.ruby-lang.org", 0=>35, 1=>"docs.ruby-lang.org"}
{"id"=>36, "name"=>"d.hatena.ne.jp", 0=>36, 1=>"d.hatena.ne.jp"}
{"id"=>37, "name"=>"www.rubylife.jp", 0=>37, 1=>"www.rubylife.jp"}
{"id"=>38, "name"=>"gcc.gnu.org", 0=>38, 1=>"gcc.gnu.org"}
{"id"=>39, "name"=>"i.loveruby.net", 0=>39, 1=>"i.loveruby.net"}
{"id"=>40, "name"=>"www.slideshare.net", 0=>40, 1=>"www.slideshare.net"}
{"id"=>41,
 "name"=>"file:///home/staff/suzuki/progs/reports/1/report-1.html",
 0=>41,
 1=>"file:///home/staff/suzuki/progs/reports/1/report-1.html"}
{"id"=>42, "name"=>"shuzo-kino.hateblo.jp", 0=>42, 1=>"shuzo-kino.hateblo.jp"}
== 
settings
{"id"=>1,
 "name"=>"browser.content.full-zoom",
 0=>1,
 1=>"browser.content.full-zoom"}
== 
prefs
{"id"=>1,
 "groupID"=>1,
 "settingID"=>1,
 "value"=>3,
 "timestamp"=>1454302922.032,
 0=>1,
 1=>1,
 2=>1,
 3=>3,
 4=>1454302922.032}
{"id"=>2,
 "groupID"=>2,
 "settingID"=>1,
 "value"=>1.2,
 "timestamp"=>1444708376.262,
 0=>2,
 1=>2,
 2=>1,
 3=>1.2,
 4=>1444708376.262}
{"id"=>3,
 "groupID"=>3,
 "settingID"=>1,
 "value"=>1.5,
 "timestamp"=>0,
 0=>3,
 1=>3,
 2=>1,
 3=>1.5,
 4=>0}
{"id"=>4,
 "groupID"=>4,
 "settingID"=>1,
 "value"=>2.4,
 "timestamp"=>1450071779.862,
 0=>4,
 1=>4,
 2=>1,
 3=>2.4,
 4=>1450071779.862}
{"id"=>5,
 "groupID"=>5,
 "settingID"=>1,
 "value"=>1.3300000429153442,
 "timestamp"=>0,
 0=>5,
 1=>5,
 2=>1,
 3=>1.3300000429153442,
 4=>0}
{"id"=>6,
 "groupID"=>6,
 "settingID"=>1,
 "value"=>1.5,
 "timestamp"=>0,
 0=>6,
 1=>6,
 2=>1,
 3=>1.5,
 4=>0}
{"id"=>7,
 "groupID"=>7,
 "settingID"=>1,
 "value"=>1.5,
 "timestamp"=>1444103807.725,
 0=>7,
 1=>7,
 2=>1,
 3=>1.5,
 4=>1444103807.725}
{"id"=>8,
 "groupID"=>8,
 "settingID"=>1,
 "value"=>2.4000000953674316,
 "timestamp"=>0,
 0=>8,
 1=>8,
 2=>1,
 3=>2.4000000953674316,
 4=>0}
{"id"=>10,
 "groupID"=>9,
 "settingID"=>1,
 "value"=>1.7000000476837158,
 "timestamp"=>0,
 0=>10,
 1=>9,
 2=>1,
 3=>1.7000000476837158,
 4=>0}
{"id"=>11,
 "groupID"=>10,
 "settingID"=>1,
 "value"=>2,
 "timestamp"=>1453800023.114,
 0=>11,
 1=>10,
 2=>1,
 3=>2,
 4=>1453800023.114}
{"id"=>12,
 "groupID"=>11,
 "settingID"=>1,
 "value"=>2.4,
 "timestamp"=>1448856870.872,
 0=>12,
 1=>11,
 2=>1,
 3=>2.4,
 4=>1448856870.872}
{"id"=>13,
 "groupID"=>12,
 "settingID"=>1,
 "value"=>2.4000000953674316,
 "timestamp"=>0,
 0=>13,
 1=>12,
 2=>1,
 3=>2.4000000953674316,
 4=>0}
{"id"=>14,
 "groupID"=>13,
 "settingID"=>1,
 "value"=>1.7000000476837158,
 "timestamp"=>0,
 0=>14,
 1=>13,
 2=>1,
 3=>1.7000000476837158,
 4=>0}
{"id"=>15,
 "groupID"=>14,
 "settingID"=>1,
 "value"=>2,
 "timestamp"=>0,
 0=>15,
 1=>14,
 2=>1,
 3=>2,
 4=>0}
{"id"=>16,
 "groupID"=>15,
 "settingID"=>1,
 "value"=>3,
 "timestamp"=>0,
 0=>16,
 1=>15,
 2=>1,
 3=>3,
 4=>0}
{"id"=>17,
 "groupID"=>16,
 "settingID"=>1,
 "value"=>1.7000000476837158,
 "timestamp"=>0,
 0=>17,
 1=>16,
 2=>1,
 3=>1.7000000476837158,
 4=>0}
{"id"=>18,
 "groupID"=>17,
 "settingID"=>1,
 "value"=>1.100000023841858,
 "timestamp"=>0,
 0=>18,
 1=>17,
 2=>1,
 3=>1.100000023841858,
 4=>0}
{"id"=>19,
 "groupID"=>18,
 "settingID"=>1,
 "value"=>1.2000000476837158,
 "timestamp"=>0,
 0=>19,
 1=>18,
 2=>1,
 3=>1.2000000476837158,
 4=>0}
{"id"=>20,
 "groupID"=>19,
 "settingID"=>1,
 "value"=>2,
 "timestamp"=>0,
 0=>20,
 1=>19,
 2=>1,
 3=>2,
 4=>0}
{"id"=>21,
 "groupID"=>20,
 "settingID"=>1,
 "value"=>2,
 "timestamp"=>1441688316.416,
 0=>21,
 1=>20,
 2=>1,
 3=>2,
 4=>1441688316.416}
{"id"=>22,
 "groupID"=>21,
 "settingID"=>1,
 "value"=>1.7,
 "timestamp"=>1443679074.734,
 0=>22,
 1=>21,
 2=>1,
 3=>1.7,
 4=>1443679074.734}
{"id"=>23,
 "groupID"=>22,
 "settingID"=>1,
 "value"=>2.4,
 "timestamp"=>1443676271.668,
 0=>23,
 1=>22,
 2=>1,
 3=>2.4,
 4=>1443676271.668}
{"id"=>24,
 "groupID"=>23,
 "settingID"=>1,
 "value"=>1.5,
 "timestamp"=>1443768405.696,
 0=>24,
 1=>23,
 2=>1,
 3=>1.5,
 4=>1443768405.696}
{"id"=>25,
 "groupID"=>24,
 "settingID"=>1,
 "value"=>1.7,
 "timestamp"=>1443770712.08,
 0=>25,
 1=>24,
 2=>1,
 3=>1.7,
 4=>1443770712.08}
{"id"=>26,
 "groupID"=>25,
 "settingID"=>1,
 "value"=>1.7,
 "timestamp"=>1443770982.739,
 0=>26,
 1=>25,
 2=>1,
 3=>1.7,
 4=>1443770982.739}
{"id"=>27,
 "groupID"=>26,
 "settingID"=>1,
 "value"=>2.4,
 "timestamp"=>1443771116.364,
 0=>27,
 1=>26,
 2=>1,
 3=>2.4,
 4=>1443771116.364}
{"id"=>28,
 "groupID"=>27,
 "settingID"=>1,
 "value"=>1.5,
 "timestamp"=>1444021456.195,
 0=>28,
 1=>27,
 2=>1,
 3=>1.5,
 4=>1444021456.195}
{"id"=>29,
 "groupID"=>28,
 "settingID"=>1,
 "value"=>1.2,
 "timestamp"=>1444022203.529,
 0=>29,
 1=>28,
 2=>1,
 3=>1.2,
 4=>1444022203.529}
{"id"=>30,
 "groupID"=>29,
 "settingID"=>1,
 "value"=>2.4,
 "timestamp"=>1444023483.543,
 0=>30,
 1=>29,
 2=>1,
 3=>2.4,
 4=>1444023483.543}
{"id"=>31,
 "groupID"=>30,
 "settingID"=>1,
 "value"=>1.7,
 "timestamp"=>1444711732.541,
 0=>31,
 1=>30,
 2=>1,
 3=>1.7,
 4=>1444711732.541}
{"id"=>32,
 "groupID"=>31,
 "settingID"=>1,
 "value"=>3,
 "timestamp"=>1445833874.97,
 0=>32,
 1=>31,
 2=>1,
 3=>3,
 4=>1445833874.97}
{"id"=>33,
 "groupID"=>32,
 "settingID"=>1,
 "value"=>3,
 "timestamp"=>1445834020.522,
 0=>33,
 1=>32,
 2=>1,
 3=>3,
 4=>1445834020.522}
{"id"=>34,
 "groupID"=>33,
 "settingID"=>1,
 "value"=>1.7,
 "timestamp"=>1445835456.61,
 0=>34,
 1=>33,
 2=>1,
 3=>1.7,
 4=>1445835456.61}
{"id"=>35,
 "groupID"=>34,
 "settingID"=>1,
 "value"=>2.4,
 "timestamp"=>1445836119.049,
 0=>35,
 1=>34,
 2=>1,
 3=>2.4,
 4=>1445836119.049}
{"id"=>36,
 "groupID"=>35,
 "settingID"=>1,
 "value"=>1.7,
 "timestamp"=>1450675055.392,
 0=>36,
 1=>35,
 2=>1,
 3=>1.7,
 4=>1450675055.392}
{"id"=>37,
 "groupID"=>36,
 "settingID"=>1,
 "value"=>2.4,
 "timestamp"=>1447648926.778,
 0=>37,
 1=>36,
 2=>1,
 3=>2.4,
 4=>1447648926.778}
{"id"=>38,
 "groupID"=>37,
 "settingID"=>1,
 "value"=>1.33,
 "timestamp"=>1447651818.77,
 0=>38,
 1=>37,
 2=>1,
 3=>1.33,
 4=>1447651818.77}
{"id"=>39,
 "groupID"=>38,
 "settingID"=>1,
 "value"=>3,
 "timestamp"=>1447739087.819,
 0=>39,
 1=>38,
 2=>1,
 3=>3,
 4=>1447739087.819}
{"id"=>40,
 "groupID"=>39,
 "settingID"=>1,
 "value"=>3,
 "timestamp"=>1449462201.667,
 0=>40,
 1=>39,
 2=>1,
 3=>3,
 4=>1449462201.667}
{"id"=>41,
 "groupID"=>40,
 "settingID"=>1,
 "value"=>1.33,
 "timestamp"=>1450067874.365,
 0=>41,
 1=>40,
 2=>1,
 3=>1.33,
 4=>1450067874.365}
{"id"=>42,
 "groupID"=>41,
 "settingID"=>1,
 "value"=>1.7,
 "timestamp"=>1453795886.473,
 0=>42,
 1=>41,
 2=>1,
 3=>1.7,
 4=>1453795886.473}
{"id"=>43,
 "groupID"=>42,
 "settingID"=>1,
 "value"=>2,
 "timestamp"=>1454304396.583,
 0=>43,
 1=>42,
 2=>1,
 3=>2,
 4=>1454304396.583}
=> ["groups", "settings", "prefs"]
irb(main):154:0* [["groups"], ["settings"], ["prefs"]]
=> [["groups"], ["settings"], ["prefs"]]
irb(main):156:0* => #<SQLite3::Database:0x007f54f97c0d30 @tracefunc=nil, @authorizer=nil, @encoding=#<Encoding:UTF-8>, @busy_handler=nil, @collations={}, @functions={}, @results_as_hash=true, @type_translation=nil, @readonly=false>
#+end_example


https://www.dropbox.com/s/kf035hpu5r7dkqo/._%20%28Masayuki%20Suzuki%20%E3%81%AE%E7%AB%B6%E5%90%88%E3%82%B3%E3%83%94%E3%83%BC%202016-01-07%20%283%29%29._Icon%0D?dl=0


** firefox sqlite database handling 2

#+BEGIN_SRC sh :results output scalar

ls -l ~/.mozilla/firefox/*/*sqlite

#+END_SRC

#+RESULTS:
: -rw-r--r--  1 m  suzuki    229376 12 24 19:31 /users/home/masayuki/.mozilla/firefox/1dtrhim2.default-1450953083451/content-prefs.sqlite
: -rw-r--r--  1 m  suzuki    524288  1  3 21:08 /users/home/masayuki/.mozilla/firefox/1dtrhim2.default-1450953083451/cookies.sqlite
: -rw-r--r--  1 m  suzuki    196608 12 26 14:29 /users/home/masayuki/.mozilla/firefox/1dtrhim2.default-1450953083451/formhistory.sqlite
: -rw-r--r--  1 m  suzuki   1146880  1  3 21:08 /users/home/masayuki/.mozilla/firefox/1dtrhim2.default-1450953083451/healthreport.sqlite
: -rw-r--r--  1 m  suzuki    131072  1  3 19:52 /users/home/masayuki/.mozilla/firefox/1dtrhim2.default-1450953083451/permissions.sqlite
: -rw-r--r--  1 m  suzuki  10485760  1  3 21:08 /users/home/masayuki/.mozilla/firefox/1dtrhim2.default-1450953083451/places.sqlite
: -rw-r--r--  1 m  suzuki    458752  1  3 19:52 /users/home/masayuki/.mozilla/firefox/1dtrhim2.default-1450953083451/webappsstore.sqlite

- *.sqlite3 をみんな出力してみましょう。
- lock されて開けないのもあるので，エラー処理をしましょう。
- 出力には，=pp= を使いましょう。
- 各dbの master record を読んでみましょう。

#+BEGIN_SRC ruby :tangle babel/sqlite3-master.rb :results output scalar
require 'rubygems'
require 'sqlite3'
require 'pp'

# dir = '/users/home/masayuki/.mozilla/firefox/1dtrhim2.default-1450953083451/'
dir = '/home/staff/suzuki/.mozilla/firefox/5rot7npz.default/'
Dir.chdir(dir) do
  Dir.glob("*.sqlite").each do |db|
    puts "** #{db}"
    begin
      db = SQLite3::Database.open(db)
      results = db.execute("select * from sqlite_master")
      pp results
    rescue  => e
      puts e
    end
  end
end

#+END_SRC

#+RESULTS:
#+begin_example
** 

#+BEGIN_SRC ruby :session ruby :results output
# coding: utf-8

require 'rubygems'
require 'sqlite3'

file = "content-prefs.sqlite"

db = SQLite3::Database.open(file)

tables = db.execute("select tbl_name FROM sqlite_master WHERE type == 'table'")

tables.flatten.each do |tbl|
  puts "== ",  tbl
  db.execute("select * from #{tbl}") do |row|
    puts row.join("\t")
  end
end

p tables

db.close

'end'
#+END_SRC

#+RESULTS:
#+begin_example

irb(main):028:0* => false
=> false
irb(main):031:0* => "content-prefs.sqlite"
irb(main):033:0* => #<SQLite3::Database:0x007f58a1bfb778 @tracefunc=nil, @authorizer=nil, @encoding=nil, @busy_handler=nil, @collations={}, @functions={}, @results_as_hash=nil, @type_translation=nil, @readonly=false>
irb(main):035:0* => [["groups"], ["settings"], ["prefs"]]
irb(main):037:0* irb(main):038:1* irb(main):039:1> irb(main):040:2* irb(main):041:2> irb(main):042:1> == 
groups
1	wiki.cis.iwate-u.ac.jp
2	about:startpage
3	www.google.com
4	qiita.com
5	subversion.apache.org
6	stackoverflow.com
7	www.google.co.jp
8	www.amazon.co.jp
9	orgmode.org
10	about:newtab
11	ja.wikipedia.org
12	spws01.cis.iwate-u.ac.jp
13	www.ietf.org
14	www.ipa.go.jp
15	svn.cis.iwate-u.ac.jp
16	www.geocities.jp
17	www6.airnet.ne.jp
18	en.wikipedia.org
19	dictionary.goo.ne.jp
20	wiki.eecs.iwate-u.ac.jp
21	file:///home/staff/suzuki/COMM/Lects/prog/site/org-docs/cutter/cutter-doc.html
22	cutter.sourceforge.net
23	www.gnu.org
24	file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/ruby_begin.html
25	magazine.rubyist.net
26	loveruby.net
27	file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/docs/meta-ruby/index.html
28	ops.tokyo
29	file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/lects/01/01-GTD.html
30	www.bookshelf.jp
31	www.ogis-ri.co.jp
32	mitpress.mit.edu
33	file:///home/staff/suzuki/COMM/Lects/meta-ruby/site/org-docs/index.html
34	libro.tuyano.com
35	docs.ruby-lang.org
36	d.hatena.ne.jp
37	www.rubylife.jp
38	gcc.gnu.org
39	i.loveruby.net
40	www.slideshare.net
41	file:///home/staff/suzuki/progs/reports/1/report-1.html
42	shuzo-kino.hateblo.jp
== 
settings
1	browser.content.full-zoom
== 
prefs
1	1	1	3	1454302922.032
2	2	1	1.2	1444708376.262
3	3	1	1.5	0
4	4	1	2.4	1450071779.862
5	5	1	1.3300000429153442	0
6	6	1	1.5	0
7	7	1	1.5	1444103807.725
8	8	1	2.4000000953674316	0
10	9	1	1.7000000476837158	0
11	10	1	2	1453800023.114
12	11	1	2.4	1448856870.872
13	12	1	2.4000000953674316	0
14	13	1	1.7000000476837158	0
15	14	1	2	0
16	15	1	3	0
17	16	1	1.7000000476837158	0
18	17	1	1.100000023841858	0
19	18	1	1.2000000476837158	0
20	19	1	2	0
21	20	1	2	1441688316.416
22	21	1	1.7	1443679074.734
23	22	1	2.4	1443676271.668
24	23	1	1.5	1443768405.696
25	24	1	1.7	1443770712.08
26	25	1	1.7	1443770982.739
27	26	1	2.4	1443771116.364
28	27	1	1.5	1444021456.195
29	28	1	1.2	1444022203.529
30	29	1	2.4	1444023483.543
31	30	1	1.7	1444711732.541
32	31	1	3	1445833874.97
33	32	1	3	1445834020.522
34	33	1	1.7	1445835456.61
35	34	1	2.4	1445836119.049
36	35	1	1.7	1450675055.392
37	36	1	2.4	1447648926.778
38	37	1	1.33	1447651818.77
39	38	1	3	1447739087.819
40	39	1	3	1449462201.667
41	40	1	1.33	1450067874.365
42	41	1	1.7	1453795886.473
43	42	1	2	1454304396.583
=> ["groups", "settings", "prefs"]
irb(main):044:0* [["groups"], ["settings"], ["prefs"]]
=> [["groups"], ["settings"], ["prefs"]]
irb(main):046:0* => #<SQLite3::Database:0x007f58a1bfb778 @tracefunc=nil, @authorizer=nil, @encoding=#<Encoding:UTF-8>, @busy_handler=nil, @collations={}, @functions={}, @results_as_hash=nil, @type_translation=nil, @readonly=false>
#+end_example


https://www.dropbox.com/s/kf035hpu5r7dkqo/._%20%28Masayuki%20Suzuki%20%E3%81%AE%E7%AB%B6%E5%90%88%E3%82%B3%E3%83%94%E3%83%BC%202016-01-07%20%283%29%29._Icon%0D?dl=0
